{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_dim": 5, "name": "embedding_layer", "batch_input_shape": [null, 250], "input_length": 250, "dtype": "float32", "output_dim": 50, "mask_zero": false, "embeddings_regularizer": null, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "activity_regularizer": null}}, {"class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "unroll": false, "implementation": 1, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "bias_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 62, "name": "lstm_1", "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "return_sequences": true, "use_bias": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.2}}, {"class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_2", "layer": {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "unroll": false, "implementation": 1, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "bias_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 62, "name": "lstm_2", "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "return_sequences": false, "use_bias": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "units": 24, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}]}