{"keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 5, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "mask_zero": false, "output_dim": 50, "input_length": 250, "activity_regularizer": null, "embeddings_constraint": null, "name": "embedding_layer", "dtype": "float32", "batch_input_shape": [null, 250], "trainable": true}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "unroll": false, "bias_constraint": null, "implementation": 1, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "units": 62, "stateful": false, "use_bias": true, "activation": "tanh", "trainable": true}}, "name": "bidirectional_1", "merge_mode": "concat", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.2}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "unroll": false, "bias_constraint": null, "implementation": 1, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "units": 62, "stateful": false, "use_bias": true, "activation": "tanh", "trainable": true}}, "name": "bidirectional_2", "merge_mode": "concat", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "name": "dense_1", "units": 16, "use_bias": true, "activation": "softmax", "trainable": true}}]}